Revit 2027 API
CoordinationModelLinkOptions.Positioning Property
 Placement option for Coordination Model linking.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CoordinationModelPositioning Positioning { get; set; }
Public Property Positioning As CoordinationModelPositioning
	Get
	Set
public:
property CoordinationModelPositioning Positioning {
	CoordinationModelPositioning get ();
	void set (CoordinationModelPositioning value);
}
member Positioning : CoordinationModelPositioning with get, set
Property Value
CoordinationModelPositioning
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CoordinationModelLinkOptions Class
Autodesk.Revit.DB.ExternalData Namespace